[

        {
            "id": 1,
            "title": "Top 5 Tips for Wheat Cultivation in Rabi Season",
            "image": "https://i.pinimg.com/736x/76/ba/9d/76ba9d7f368379e839faa110653a0c2c.jpg",
            "category": "Rabi",
            "tags": ["wheat", "rabi", "soil"],
            "description": "Follow these essential wheat growing tips for higher yield this Rabi season and ensure a successful harvest with optimal practices.",
            "content": "Wheat is one of the major Rabi crops in India, and its successful cultivation requires attention to detail and season-specific techniques. Here are the top five expert-recommended tips to ensure higher yield and better grain quality during the Rabi season:\n\n1. **Use Certified High-Yielding Seed Varieties:** Always select certified seeds from reliable sources such as agricultural universities or Krishi Vigyan Kendras (KVKs). Varieties like HD-2967, PBW-343, and HD-3086 are known for their resilience and good yields. Certified seeds ensure better germination, disease resistance, and crop uniformity.\n\n2. **Optimal Temperature and Sowing Time:** Rabi wheat grows best in an average daytime temperature of 20–22°C. Sowing should ideally be done between **15th October and 15th November**. Delayed sowing reduces yield. Proper soil preparation and timely sowing are crucial to take full advantage of the favorable Rabi climate.\n\n3. **Balanced Nutrition with Organic Inputs:** Before sowing, apply well-decomposed **farmyard manure or compost (10–15 tons per acre)** to enrich the soil. A soil test is recommended to determine NPK requirements. Typically, 100–120 kg urea, 60 kg DAP, and 40 kg MOP per acre can be applied in splits. Organic micronutrients like zinc and boron help improve grain size and quality.\n\n4. **Timely Irrigation Management:** Wheat requires **4–5 irrigations** during its lifecycle. The most critical irrigation is the **Crown Root Initiation (CRI) stage**, around 21 days after sowing. Other important stages are tillering, jointing, flowering, and grain filling. Avoid over-irrigation as it may lead to root diseases and lodging.\n\n5. **Crop Rotation and Residue Management:** Rotate wheat with legumes like chickpea or mustard to improve soil fertility and break pest/disease cycles. Avoid burning crop residues as it destroys soil microorganisms. Instead, use residue mulching or incorporate remains into the soil using rotavators.\n\nAdopting these scientific practices not only enhances productivity but also improves the sustainability of wheat farming. Farmers are encouraged to stay updated with local agricultural advisories and take weather conditions into account during the season for best results.",
            "date": "2025-04-01",
            "popularity": 80
          }
          
    ,
    {
      "id": 2,
      "title": "Managing Pests in Vegetable Crops during Summer",
      "image": "https://i.pinimg.com/736x/a4/e4/70/a4e4702967cbacd4e21ff3be8496146d.jpg",
      "category": "Summer",
      "tags": ["vegetables", "pest", "organic"],
      "description": "Organic and low-cost pest management for summer crops...",
      "content": "Summer brings higher temperatures and humidity levels, which can create the perfect conditions for pest infestations in vegetable crops like brinjal, tomato, chili, and okra. Farmers should stay vigilant and adopt preventive and control measures early on to reduce crop losses.\n\nKey organic strategies include the use of neem oil (5ml/litre) combined with chili or garlic extracts, sprayed every 7-10 days. This acts as a natural repellent and inhibits pest reproduction. For added effectiveness, a few drops of soap solution can be added to enhance adherence to leaf surfaces.\n\nSticky yellow and blue traps should be installed in fields to monitor and control flying insects such as whiteflies and thrips. These should be placed above plant canopy and monitored weekly. It's advisable to change them when they become full or dirty.\n\nWatering should be done in the early morning to reduce the chance of fungal diseases. Avoid wetting leaves directly, and instead use drip irrigation if possible. Overwatering and poor drainage can encourage root rot and fungal spores.\n\nEncourage natural predators like ladybugs and spiders in your farm ecosystem by avoiding broad-spectrum chemical pesticides. Companion planting (e.g., marigold with tomatoes) can also help repel certain pests naturally.\n\nIn case of severe infestations, farmers may use botanical-based insecticides like Beauveria bassiana or Verticillium lecanii after consulting an agricultural advisor. Crop rotation and intercropping are long-term strategies to break the pest life cycle.\n\nMaintaining hygiene in and around the field, removing infected plant material, and routinely inspecting crops can significantly lower the chance of outbreaks. Early detection is key, so daily inspection of crops for eggs, larvae, and insect damage is recommended.\n\nBy combining multiple strategies under the Integrated Pest Management (IPM) approach, farmers can ensure healthier crops, better yield, and reduced reliance on expensive chemical pesticides. These practices not only save money but also preserve soil health and ecosystem balance.",
      "date": "2025-03-28",
      "popularity": 90
    },
    {
        "id": 3,
        "title": "Sustainable Paddy Cultivation for Kharif Season",
        "image": "https://i.pinimg.com/736x/40/b3/ba/40b3baac5f0ed8cc173a0156cef0df11.jpg",
        "category": "Kharif",
        "tags": ["paddy", "organic", "kharif"],
        "description": "Learn how to grow paddy sustainably with modern practices during the Kharif season.",
        "content": "Paddy is the staple crop for many Indian states, especially during the Kharif season. Here's how to adopt sustainable and efficient methods for cultivation:\n\n1. **Selection of Short-Duration, Drought-Resistant Varieties:** Choose improved seed varieties such as IR-64, MTU-1010, or hybrid rice depending on the rainfall pattern and soil.\n\n2. **SRI (System of Rice Intensification) Method:** Use younger seedlings (8–12 days old), wide spacing (25x25 cm), and less water to increase yield by 25–30% and reduce input cost.\n\n3. **Water Management:** Instead of continuous flooding, use alternate wetting and drying (AWD) to save up to 40% of irrigation water. Monitor with field water tubes.\n\n4. **Organic Pest Management:** Spray neem oil every 12 days. Use pheromone traps for stem borers. Apply Trichoderma-based compost to control fungal diseases.\n\n5. **Post-Harvest Processing:** Harvest at 80–85% maturity to avoid shattering. Use solar drying or shade drying to preserve nutritional value. Store in airtight containers to avoid weevil infestation.\n\nFollowing these methods ensures better yields, lower input cost, and eco-friendly farming.",
        "date": "2025-03-15",
        "popularity": 85
      },
      {
        "id": 4,
        "title": "Tips to Maximize Fruit Yield in Mango Orchards",
        "image": "https://i.pinimg.com/736x/47/fd/06/47fd06779814bc4e59344678328c23ac.jpg",
        "category": "Summer",
        "tags": ["mango", "orchard", "fruit"],
        "description": "Boost your mango orchard's productivity with these expert horticultural tips.",
        "content": "Mango trees need proper management throughout the year to ensure good flowering and fruiting. Here’s what farmers can do:\n\n1. **Pruning & Training:** After harvest (May-June), remove dry or diseased branches. Allow proper sunlight to penetrate.\n\n2. **Nutrient Management:** Apply 30–40 kg FYM, 1 kg Urea, 1.5 kg Superphosphate, and 1 kg MOP per tree. Split urea in 2 doses—pre-flowering and fruit-setting stages.\n\n3. **Pest Control:** Mango hoppers, fruit flies, and powdery mildew are common. Use neem-based bio-pesticides or organic soap sprays. Trap flies using methyl eugenol traps.\n\n4. **Flower Induction & Pollination:** Spray 1% potassium nitrate pre-flowering. Encourage bee population with flowering plants like mustard nearby for better pollination.\n\n5. **Irrigation & Mulching:** Drip irrigation is best. Mulch with dry grass or sugarcane leaves to retain moisture and suppress weeds.\n\nThese practices help boost quality and quantity of mango production while protecting soil health.",
        "date": "2025-04-05",
        "popularity": 93
      },
      {
        "id": 5,
        "title": "Organic Kitchen Gardening for Urban Farmers",
        "image": "https://i.pinimg.com/736x/b3/f1/c8/b3f1c8db01e2891820d9de1393f94e7c.jpg",
        "category": "Rabi",
        "tags": ["urban", "organic", "vegetables"],
        "description": "Start your own kitchen garden with minimal space and effort. Fresh, organic vegetables at your doorstep!",
        "content": "Urban kitchen gardening is an ideal way to grow chemical-free vegetables in balconies, terraces, or backyards. Here's how to start:\n\n1. **Select the Right Containers & Soil Mix:** Use 10–15 inch pots or recycled buckets with drainage holes. Fill with a 50:30:20 mix of garden soil, compost, and cocopeat.\n\n2. **Crop Planning by Season:** Grow spinach, coriander, lettuce in winters; tomato, brinjal, okra in summer; and radish, carrot in monsoon. Stagger sowing for continuous harvest.\n\n3. **Composting Kitchen Waste:** Convert peels and scraps into compost. Use this nutrient-rich compost every 20 days to boost plant growth organically.\n\n4. **Natural Pest Control:** Spray garlic + neem + turmeric mix to repel aphids and mites. Introduce ladybugs or earthworms to enhance soil health.\n\n5. **Watering & Sunlight:** Ensure 5–6 hours of sunlight. Water daily in summer, alternate days in winter. Install a drip system or use recycled water bottles for slow watering.\n\nUrban gardening improves health, reduces expenses, and brings peace of mind. A perfect solution for eco-conscious families.",
        "date": "2025-04-10",
        "popularity": 95
      },
      {
        "id": 6,
        "title": "Summer Tips for Vegetable Farming in Hot Climates",
        "image": "https://i.pinimg.com/736x/d9/b0/83/d9b0838c0ac6114b77f10401127f8c72.jpg",
        "category": "Summer",
        "tags": ["vegetables", "summer", "irrigation", "fertilizer"],
        "description": "Essential tips to grow vegetables effectively during the summer heat.",
        "content": "1. Use drip irrigation to avoid water wastage and ensure deep soil penetration.\n2. Mulch your crops to retain moisture and keep soil temperature stable.\n3. Water early in the morning or late in the evening to reduce evaporation.\n4. Use shade nets or row covers to protect tender vegetables from direct sunlight.\n5. Opt for heat-tolerant varieties like okra, eggplant, and tomatoes.\n6. Fertilize plants with slow-release fertilizers to prevent nutrient loss in the heat.",
        "date": "2025-05-05",
        "popularity": 88
      }
      
      
      
    
  ]
  